Script started on Fri 20 Jan 2017 02:07:12 PM EST
[?1034h[eos11:~/workspace/OSHomework/Lab01]$ gcc -Wall -g lab01_a.c  -ol [K[K lab01_a.
lab01_a.c  lab01_a.o  
[eos11:~/workspace/OSHomework/Lab01]$ gcc -Wall -g lab01_a.c  -o lab01_a.o
[eos11:~/workspace/OSHomework/Lab01]$ gdb lab01_a.o 
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-94.el7
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /home/vandercg/workspace/OSHomework/Lab01/lab01_a.o...done.
(gdb) break 4
Breakpoint 1 at 0x400551: file lab01_a.c, line 4.
(gdb) ste[K[K[Kprint num
No symbol "num" in current context.
(gdb) next
The program is not being run.
(gdb) run
Starting program: /home/vandercg/workspace/OSHomework/Lab01/lab01_a.o 

Breakpoint 1, main () at lab01_a.c:5
5	  double num = 0.0;
(gdb) next
6	  printf ("Hello, world.\n");
(gdb) print num
$1 = 0
(gdb) next
Hello, world.
7	  num = pow (2, 28);
(gdb) next
8	  printf ("You  are the %f person to write this program!\n", num);
(gdb) primt[K[Knt num
$2 = 268435456
(gdb) next
You  are the 268435456.000000 person to write this program!
9	  return 0;
(gdb) next
10	}
(gdb) next
0x00007ffff7a52a85 in __libc_start_main () from /home/vandercg/.linuxbrew/lib/libc.so.6
(gdb) next
Single stepping until exit from function __libc_start_main,
which has no line number information.
[Inferior 1 (process 27341) exited normally]
(gdb) ex[K[Kqu[Kuit
[eos11:~/workspace/OSHomework/Lab01]$ exit
exit

Script done on Fri 20 Jan 2017 02:08:20 PM EST
